
#include    "USER_PROGRAM.H"
               
                  
               
//==============================================
//**********************************************
//==============================================
#pragma vector  Interrupt_Extemal        @ 0x04
void Interrupt_Extemal()
{
	_nop();		
}

void delay_us(int x)
{
	while(x--);		
}



//unsigned char  key1,key2,key3,key4,key5,key6;
unsigned char  key[6];
unsigned char  Out[6];
unsigned char  BL[6];
unsigned char  K[6];
unsigned char  i;

//输出控制
//#define Out[0]   _pc3;
//#define Out[1]   _pc2;
//#define Out[2]   _pc1;
//#define Out[3]   _pc0;
//#define Out[4]   _pb1;1
//#define Out[5]   _pb0;
//
////背光控制
//#define BL[0]    _pa7;
//#define BL[1]    _pa2;
//#define BL[2]    _pa0;
//#define BL[3]    _pa3;
//#define BL[4]    _pa4;
//#define BL[5]    _pa1;
//
////按键
//#define K[0]     _pb7;
//#define K[1]     _pb6;
//#define K[2]     _pb5;
//#define K[3]     _pb4;
//#define K[4]     _pb3;
//#define K[5]     _pb2;


//==============================================
//**********************************************
//==============================================
void USER_PROGRAM_INITIAL()  //这个初始化的时候用到
{
	
 // _papu=0;
 // _pac=0;	
 // _pa=0;
 	
 	//按键状态变量
//    key[0]=0;
//    key[1]=0;  
//    key[2]=0;  
//    key[3]=0;  
//    key[4]=0;  
//    key[5]=0;

	//按键
	K[0]=_pb7;
	K[1]=_pb6;
	K[2]=_pb5;
	K[3]=_pb4;
	K[4]=_pb3;
	K[5]=_pb2; 
      
  /**********************按键输入配置*********************/   
   //设为输入
   _pbc2=1;   
   _pbc3=1;
   _pbc4=1;
   _pbc5=1;
   _pbc6=1;
   _pbc7=1;
   //设为上拉
   _pbpu2=1;
   _pbpu3=1;
   _pbpu4=1;
   _pbpu5=1;
   _pbpu6=1;
   _pbpu7=1;
   
  
  /***********************设置输出**********************/
   //输出控制设为输出
   _pbc0=0; 
   _pbc1=0;
   _pcc0=0;
   _pcc1=0;
   _pcc2=0;
   _pcc3=0;
   
   //背光控制设为输出   
   _pac1=0;
   _pac4=0;
   _pac3=0;
   _pac0=0;
   _pac2=0;
   _pac7=0;
   
   //背光微亮控制设为输出
   _pcc4=0;
   
  /***********************设置上拉***********************/
   //输出控制设为上拉
   _pbpu0=1;     	
   _pbpu1=1;
   _pcpu0=1;
   _pcpu1=1;
   _pcpu2=1;
   _pcpu3=1;
   
   //背光控制设为上拉
   _papu1=1;
   _papu4=1;
   _papu3=1;
   _papu0=1;
   _papu2=1;
   _papu7=1;
   
   //背光微亮控制设为上拉
   _pcpu4=1;    
 
  /**********************设置输出为低********************/
   //继电器输出关闭
 /*  _pc3=0;
   _pc2=0;
   _pc1=0;
   _pc0=0;
   _pb1=0;
   _pb0=0;*/
      
   //背光灯关闭
/*   _pa1=0;
   _pa4=0; 
   _pa3=0;
   _pa0=0;
   _pa2=0;
   _pa7=0;  */

   //背光微亮关闭
   _pc4=0;
   
  /**********************程序配置管脚*********************/   
   
   //PC7设为上拉输入，如果是低电平，就用没有微光     0开启微亮背光，1关闭微亮背光
   _pcc7=1;
   _pcpu7=1;   
   
   //PC6设为上拉输入，如果是低电平，触摸按键没有用。 0为单片机点动亮背光，1为开关量背光  
   _pcc6=1;
   _pcpu6=1;
   
   //按下就亮松开就灭   0为点动，1为非点动 
   _pcc5=1; 
   _pcpu5=1;
   	
}

//==============================================
//**********************************************
//==============================================
	
void USER_PROGRAM()  
{			
	USER_PROGRAM_INITIAL(); //初始化
	
    GET_KEY_BITMAP();  //这个就是调用触摸函数
    /* 
    if(_pc6!=0) //外部控制背光灯
    { 
	    _pa2=0;
	    _pa3=0;
	    _pa0=0;
	    _pa7=0;
	    _pa4=0;
	    _pa1=0;
    } //这个是关闭所有灯光
    */
    
   //pc7  0开启微亮背光，1关闭微亮背光
   if(_pc7!=0)    
   { 
   		_pc4=0;//没有微光
   }  
   else
   {
   		_pc4=1;//有微光 
   }   	
	 	  
 /*************************************点动，背光点动亮*************************************/ 
 #if 0
 if(_pc5==1 && _pc6==0) //S3 不短接, S2 短接 ：点动，背光点动亮 
 {
 	for(i=0;i<6;i++)
	{
	 	if(K[i]==0)
	 	{
	 		Out[i]=1;   //输出高电平
	 		BL[i]=1; 	//打开背光	
	 	} 	
	 	else
	 	{
	 		Out[i]=0;   //输出低电平
	 		BL[i]=0; 	//关闭背光	
	 	}	 	
	} 
 }
 
 /*************************************点动，自控背光*************************************/ 
 
 if(_pc5==1 && _pc6==1) //S3 不短接, S2 不短接 ：点动，自控背光
 {    
 	 for(i=0;i<6;i++)
	 {
	 	if(K[i]==0 && key[i]==0)
	 	{
	 		Out[i]=1;   //输出高电平
	 		BL[i]=1; 	//打开背光
	 		key[i]=1;	
	 	} 	
	 	else if(K[i]==0 && key[i]==1)
	 	{
	 		Out[i]=1;   //输出高电平
	 		BL[i]=0; 	//关闭背光	
	 		key[i]=0;
	 	}else 
	 		Out[i]=0;   //输出低电平	 		 		 	
	 } 
 }
 
// #if 0
/*************************************非点动，背光点动亮*************************************/  

 if(_pc5==0 && _pc6==0) //S3 短接, S2 短接 ：非点动，背光点动亮
 {   	
 	 for(i=0;i<6;i++)
	 {
	 	if(K[i]==0 && key[i]==0)
	 	{
	 		Out[i]=1;   //输出高电平
	 		BL[i]=1; 	//打开背光
	 		key[i]=1;	
	 	} 	
	 	else if(K[i]==0 && key[i]==1)
	 	{
	 		Out[i]=0;   //输出低电平
	 		BL[i]=1; 	//打开背光	
	 		key[i]=0;
	 	}else 
	 		BL[i]=0;   //关闭背光	 		 		 	
	 } 
 }	 
 #endif
 
 
 /*************************************非点动，自控背光*************************************/ 
 
 if(_pc5==0 && _pc6==1) //S3 短接, S2 不短接 ：非点动，自控背光
 {   	
 	 for(i=0;i<6;i++)
	 {
	 	if(K[i]==0 && key[i]==0)
	 	{
	 		Out[i]=1;   //输出高电平
	 		BL[i]=1; 	//打开背光	 		
	 		delay_us(100);	
	 		while(K[i]==0) 		
	 		key[i]=1;	 				
	 	} 	
//	 	else if(K[i]==0 && key[i]==1)
//	 	{
//	 		Out[i]=0;   //输出低电平
//	 		BL[i]=0; 	//关闭背光	
//	 		//while(K[i]==0)	
//	 		delay_us(100);	 
//	 		while(K[i]==0) 		
//	 		key[i]=0;	 		
//	 	}	 		 		 	
	 } 
 }

	_pc3=Out[0];
	_pc2=Out[1];
	_pc1=Out[2];
	_pc0=Out[3];
	_pb1=Out[4];
	_pb0=Out[5];

	_pa7=BL[0];
	_pa2=BL[1];
	_pa0=BL[2];
	_pa3=BL[3];
	_pa4=BL[4];
	_pa1=BL[5];


#if 0 
 /*************************************点动，背光点动亮*************************************/ 
   
 if(_pc5==1 && _pc6==0) //S3 不短接, S2 短接 ：点动，背光点动亮
 {  
    //if(((DATA_BUF[0]&0x04)==0x04))//&&(key5==0)) //触摸取值 //pb2
    if(_pb2==0) //轻触按键取值 //pb2
     {  
         _pb0=1;
         _pa1=1;     
     }
     else 
   		{ 
   			_pb0=0; 
   			_pa1=0; 
   		}
    
     //if(((DATA_BUF[0]&0x08)==0x08))//&&(key6==0))//触摸取值  //pb3
     if(_pb3==0) //轻触按键取值  //pb3
     {  
   		_pb1=1;  
   		_pa4=1;   	 
     }
     else 
   		{ 
   			_pb1=0; 
   			_pa4=0; 
   		}  	 	

     //if(((DATA_BUF[0]&0x10)==0x10))//&&(key3==0))//触摸取值 //pb4
     if(_pb4==0) //轻触按键取值  //pb4
     {  
        _pc0=1;    
        _pa3=1;    	 
     }
     else 
   		{
   			_pc0=0; 
   			_pa3=0; 
   		}
      
     //if(((DATA_BUF[0]&0x20)==0x20))//&&(key2==0))//触摸取值  //pb5
     if(_pb5==0) //轻触按键取值  //pb5
     {  
   	    _pc1=1;
   	    _pa0=1;     	 
     }
     else 
   		{ 
   			_pc1=0; 
   			_pa0=0; 
   		}
   		
   
     //if(((DATA_BUF[0]&0x40)==0x40))//&&(key4==0))//触摸取值  //pb6
     if(_pb6==0) //轻触按键取值  //pb6
     {  
        _pc2=1;
        _pa2=1;   
     }
     else 
   		{ 
   			_pc2=0;
   			_pa2=0; 
   		}      
  
  
     //if(((DATA_BUF[0]&0x80)==0x80))//&&(key1==0))//触摸取值  //pb7
     if(_pb7==0) //轻触按键取值  //pb7
     {  
   	   _pc3=1;
   	   _pa7=1;   	      	 
     }
     else 
   		{
   			_pc3=0;
   			_pa7=0;
   		}       		    
 }
 
 /*************************************点动，自控背光*************************************/ 
 
 if(_pc5==1 && _pc6==1) //S3 不短接, S2 不短接 ：点动，自控背光
 {  
    //if(((DATA_BUF[0]&0x04)==0x04))//&&(key5==0)) //触摸取值 //pb2
    if( _pb2==0 && key6==0 ) //轻触按键取值 //pb2
     {  
         _pb0=1;//输出高电平
         _pa1=1;//打开背光
         key6=1;     
     }
     else if( _pb2==0 && key6==1 )
   		{ 
   			_pb0=1; //输出高电平
   			_pa1=0; //关闭背光
   			key6=0; 
   		}else _pb0=0; //输出低电平
    
     //if(((DATA_BUF[0]&0x08)==0x08))//&&(key6==0))//触摸取值  //pb3
     if( _pb3==0 && key5==0 ) //轻触按键取值  //pb3
     {  
   		_pb1=1;  
   		_pa4=1;
   		key5=1;   	 
     }
     else if( _pb3==0 && key5==1 )
   		{ 
   			_pb1=1; 
   			_pa4=0; 
   			key5=0;  
   		}else _pb1=0; 	


     //if(((DATA_BUF[0]&0x10)==0x10))//&&(key3==0))//触摸取值 //pb4
     if( _pb4==0 && key4==0 ) //轻触按键取值  //pb4
     {  
        _pc0=1;    
        _pa3=1; 
        key4=1;   	 
     }
     else if( _pb4==0 && key4==1 )
   		{
   			_pc0=1; 
   			_pa3=0; 
   			key4=0;
   		}else _pc0=0; 
      
      
     //if(((DATA_BUF[0]&0x20)==0x20))//&&(key2==0))//触摸取值  //pb5
     if( _pb5==0 && key3==0 ) //轻触按键取值  //pb5
     {  
   	    _pc1=1;
   	    _pa0=1;
   	    key3=1;      	 
     }
     else if( _pb5==0 && key3==1 )
   		{ 
   			_pc1=1; 
   			_pa0=0; 
   			key3=0; 
   		}else _pc1=0; 
   		
   
     //if(((DATA_BUF[0]&0x40)==0x40))//&&(key4==0))//触摸取值  //pb6
     if( _pb6==0 && key2==0 ) //轻触按键取值  //pb6
     {  
        _pc2=1;
        _pa2=1; 
        key2=1;  
     }
     else if( _pb6==0 && key2==1 )
   		{ 
   			_pc2=1;
   			_pa2=0;
   			key2=0;   
   		}else _pc2=0;       
  
  
     //if(((DATA_BUF[0]&0x80)==0x80))//&&(key1==0))//触摸取值  //pb7
     if( _pb7==0 && key1==0 ) //轻触按键取值  //pb7
     {  
   	   _pc3=1;
   	   _pa7=1;
   	   key1=1;
     }
     else if( _pb7==0 && key1==1 )
   		{
   			_pc3=1;
   			_pa7=0;
   			key1=0;
   		}else _pc3=0;        		    
 }    

  
 /*************************************非点动，背光点动亮*************************************/ 
 

 if(_pc5==0 && _pc6==0) //S3 短接, S2 短接 ：非点动，背光点动亮
 {  
    //if(((DATA_BUF[0]&0x04)==0x04))//&&(key5==0)) //触摸取值 //pb2
    if( _pb2==0 && key6==0 ) //轻触按键取值 //pb2
     {  
         _pb0=1;//输出高电平
         _pa1=1;//打开背光
         key6=1;     
     }
     else if( _pb2==0 && key6==1 )
   		{ 
   			_pb0=0; //输出低电平
   			_pa1=1; //关闭背光
   			key6=0; 
   		}else _pa1=1; //关闭背光
    
     //if(((DATA_BUF[0]&0x08)==0x08))//&&(key6==0))//触摸取值  //pb3
     if( _pb3==0 && key5==0 ) //轻触按键取值  //pb3
     {  
   		_pb1=1;  
   		_pa4=1;
   		key5=1;   	 
     }
     else if( _pb3==0 && key5==1 )
   		{ 
   			_pb1=0; 
   			_pa4=1; 
   			key5=0;  
   		}else _pa4=0;	


     //if(((DATA_BUF[0]&0x10)==0x10))//&&(key3==0))//触摸取值 //pb4
     if( _pb4==0 && key4==0 ) //轻触按键取值  //pb4
     {  
        _pc0=1;    
        _pa3=1; 
        key4=1;   	 
     }
     else if( _pb4==0 && key4==1 )
   		{
   			_pc0=0; 
   			_pa3=1; 
   			key4=0;
   		}else _pa3=0; 
      
      
     //if(((DATA_BUF[0]&0x20)==0x20))//&&(key2==0))//触摸取值  //pb5
     if( _pb5==0 && key3==0 ) //轻触按键取值  //pb5
     {  
   	    _pc1=1;
   	    _pa0=1;
   	    key3=1;      	 
     }
     else if( _pb5==0 && key3==1 )
   		{ 
   			_pc1=0; 
   			_pa0=1; 
   			key3=0; 
   		}else _pa0=0; 
   		
   
     //if(((DATA_BUF[0]&0x40)==0x40))//&&(key4==0))//触摸取值  //pb6
     if( _pb6==0 && key2==0 ) //轻触按键取值  //pb6
     {  
        _pc2=1;
        _pa2=1; 
        key2=1;  
     }
     else if( _pb6==0 && key2==1 )
   		{ 
   			_pc2=0;
   			_pa2=1;
   			key2=0;   
   		}else _pa2=0;      
  
  
     //if(((DATA_BUF[0]&0x80)==0x80))//&&(key1==0))//触摸取值  //pb7
     if( _pb7==0 && key1==0 ) //轻触按键取值  //pb7
     {  
   	   _pc3=1;
   	   _pa7=1;
   	   key1=1;
     }
     else if( _pb7==0 && key1==1 )
   		{
   			_pc3=0;
   			_pa7=1;
   			key1=0;
   		}else _pa7=0;       		    
 }    
 
 /*************************************非点动，自控背光*************************************/ 
 
 if(_pc5==0 && _pc6==1) //S3 短接, S2 不短接 ：非点动，自控背光
 {  
    //if(((DATA_BUF[0]&0x04)==0x04))//&&(key5==0)) //触摸取值 //pb2
    if( _pb2==0 && key6==0 ) //轻触按键取值 //pb2
     {  
         _pb0=1;//输出高电平
         _pa1=1;//打开背光
         key6=1;     
     }
     else if( _pb2==0 && key6==1 )
   		{ 
   			_pb0=0; //输出低电平
   			_pa1=0; //关闭背光
   			key6=0; 
   		}
    
     //if(((DATA_BUF[0]&0x08)==0x08))//&&(key6==0))//触摸取值  //pb3
     if( _pb3==0 && key5==0 ) //轻触按键取值  //pb3
     {  
   		_pb1=1;  
   		_pa4=1;
   		key5=1;   	 
     }
     else if( _pb3==0 && key5==1 )
   		{ 
   			_pb1=0; 
   			_pa4=0; 
   			key5=0;  
   		}	


     //if(((DATA_BUF[0]&0x10)==0x10))//&&(key3==0))//触摸取值 //pb4
     if( _pb4==0 && key4==0 ) //轻触按键取值  //pb4
     {  
        _pc0=1;    
        _pa3=1; 
        key4=1;   	 
     }
     else if( _pb4==0 && key4==1 )
   		{
   			_pc0=0; 
   			_pa3=0; 
   			key4=0;
   		}
      
      
     //if(((DATA_BUF[0]&0x20)==0x20))//&&(key2==0))//触摸取值  //pb5
     if( _pb5==0 && key3==0 ) //轻触按键取值  //pb5
     {  
   	    _pc1=1;
   	    _pa0=1;
   	    key3=1;      	 
     }
     else if( _pb5==0 && key3==1 )
   		{ 
   			_pc1=0; 
   			_pa0=0; 
   			key3=0; 
   		}
   		
   
     //if(((DATA_BUF[0]&0x40)==0x40))//&&(key4==0))//触摸取值  //pb6
     if( _pb6==0 && key2==0 ) //轻触按键取值  //pb6
     {  
        _pc2=1;
        _pa2=1; 
        key2=1;  
     }
     else if( _pb6==0 && key2==1 )
   		{ 
   			_pc2=0;
   			_pa2=0;
   			key2=0;   
   		}   
  
  
     //if(((DATA_BUF[0]&0x80)==0x80))//&&(key1==0))//触摸取值  //pb7
     if( _pb7==0 && key1==0 ) //轻触按键取值  //pb7
     {  
   	   _pc3=1;
   	   _pa7=1;
   	   key1=1;
     }
     else if( _pb7==0 && key1==1 )
   		{
   			_pc3=0;
   			_pa7=0;
   			key1=0;
   		}   		    
 }    
 #endif
  
}
